package com.eyad.alalimi.sonya7rvreview.nbautoazkar;

import android.content.BroadcastReceiver;
import android.content.Context;
import android.content.Intent;
import android.graphics.PixelFormat;
import android.os.Build;
import android.view.Gravity;
import android.view.LayoutInflater;
import android.view.View;
import android.view.WindowManager;
import android.widget.TextView;

import com.eyad.alalimi.sonya7rvreview.R;

import java.util.ArrayList;
import java.util.Random;

/**
 * Created by anwar_se on 7/27/2019
 * Email: anwar.dev.96@gmail.com.
 */
public class ReciverNoti extends BroadcastReceiver {

    // region Constants
    private static final String TAG = "Notification_Log";
    public static ArrayList<String> azkar = new ArrayList<String>() {
        {
            add("لا اله الا الله");
            add("اللهم صل علي محمد");
            add("سبحان الله و بحمده سبحان الله العظيم");
            add("اللهم اغفر لي و للمسلمين و المسلمات");
            add("لا حول ولا قوة الا بالله");
            add("سبحان الله");
            add("الله اكبر");
            add("ما شاء الله");
            add("تبارك الله");
            add("اللهم اغفر لي");
            add("لا اله الا انت سبحانك انى كنت من الظالمي");
            add(" رب أنى ظلمت نفسى فاغفر لى,انه لا يغفر الذنوب الا انت");
            add("اللهم آتنا فى الدنيا حسنة و فى الاخرة حسنة و قنا عذاب النار");
            add("اللهم أغفر لوالدى و ارحمهما كما ربيانى صغيرا");
            add("رب أشرح لى صدرى و يسر لى أمرى , و أحلل عقدة لسانى يفقهوا قولى");
            add("اللهم انك عفو كريم تحب العفو فاعف عنا.");
            add(" سبحان الله وبحمده ");
            add("لا احول ولا قوة إلا بالله");
            add("رب أنى ظلمت نفسى و الا تغفر لى و ترحمنى لأكونن من الخاسرين");
            add("رب لا تذرنى فردا و أنت خير الوارثين");
            add("ربنا آتنا ثواب الدنيا و حسن ثواب الآخرة");
            add("ربنا اغفر لى و لوالدى و للمؤمنين يوم يقوم الحساب");
            add("رضيت بالله رباً و بالإسلام ديناً وبمحمد صلى الله عليه وسلم نبياً");
            add(" حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم في اليوم");
            add("سبحان الله و الحمد لله ولا إله إلا الله و الله أكبر");
            add(" اللهم عافنا و اعف عنا فى الدنيا و الآخرة");
            add("اللهم أجعلنا من الذين يستمعون القول فيتبعون أحسنه");
            add("ربنا لا تجعلنا فتنة للذين كفروا و اغفر لنا ربنا انك أنت العزيز الحكيم");
            add("اللهم صل على نبينا محمد صلى الله عليه و سلم");
            add("الحمد لله على كل نعمة كانت أو هي كائنة");
            add("لا إله إلا الله العظيم الحليم");
            add("للهم أكثر مالي، وولدي، وبارك لي فيما أعطيتني");
            add("اللهم إني أعوذ بك من شر ما عملت، ومن شر ما لم أعمل");
            add("اللهم اهدني وسددني، اللهم إني أسألك الهدى والسداد");
            add("اللهم أحسن عاقبتنا في الأمور كلها، وأجرنا من خزي الدنيا وعذاب الآخرة");
            add("اللهم إني أسألك العافية في الدنيا والآخرة");
            add("اللهم مصرف القلوب صرف قلوبنا على طاعتك");
            add("لا إله إلا الله رب العرش العظيم،");
            add("اللهم إني أسألك الهدى، والتقى، والعفاف، والغنى");
            add("اللهم إني أعوذ بك من جهد البلاء، ودرك الشقاء، وسوء القضاء، وشماتة الأعداء");
            add("اللهم إني أسألك العافية في الدنيا والآخرة");
            add("اللهم إنك عفو كريم تحب العفو فاعف عني");
            add("اللهم إني أعوذ بك من منكرات الأخلاق، والأعمال، والأهواء");
            add("اللهم إني أعوذ بك من البرص، والجنون، والجذام، ومن سيئ الأسقام");
            add("اللهم إني أعوذ بك من شر سمعي، ومن شر بصري، ومن شر لساني، ومن شر قلبي، ومن شر منيي");
            add("رب أعني ولا تعن علي، وانصرني ولا تنصر علي");
            add("اللهم إني أعوذ بك من الجوع، فإنه بئس الضجيع،");
            add("اللهم إني أسألك من فضلك ورحمتك، فإنه لا يملكها إلا أنت");
            add("اللهم اغفر لي ذنبي، ووسع لي في داري، وبارك لي في رزقي");
            add("اللهم اجعل أوسع رزقك علي عند كبر سني، وانقطاع عمري");
            add("اللهم إني ظلمت نفسي ظلماً كثيراً، ولا يغفر الذنوب إلا أنت. فاغفر لي مغفرة من عندك، وارحمني إنك أنت الغفور الرحيم");
            add("اللهم اغفر لي خطيئتي، وجهلي، وإسرافي في أمري");
            add("اللهم انفعني بما علمتني، وعلمني ما ينفعني، وزدني علم");
            add("اللهم إني أعوذ بك أن أشرك بك وأنا أعلم، وأستغفرك لما لا أعلم");
            add("");
            add("اللهم إني أعوذ بك من جار السوء في دار المقامة؛ فإن جار البادية يتحول");
            add("اللهم إني أعوذ بك من الفقر، والقلة، والذلة، وأعوذ بك من أن أظلم أو أظلم");
            add("اللهم إني أعوذ بك من العجز، والكسل، والجبن، والبخل، والهرم");
            add("اللهم اجعل أوسع رزقك علي عند كبر سني، وانقطاع عمري");
            add("اللهم إني أعوذ بك من البرص، والجنون، والجذام، ومن سيئ الأسقام");
            add("اللهم إني أعوذ بك من منكرات الأخلاق، والأعمال، والأهواء");
            add("اللهم إنك عفو كريم تحب العفو فاعف عني");
            add("الله إني أسألك يا الله بأنك الواحد الأحد، الصمد الذي لم يلد ولم يولد، ولم يكن له كفواً أحد، أن تغفر لي ذنوبي، إنك أنت الغفور الرحيم");
            add("اللهم إني أسألك علماً نافعاً، ورزقاً طيباً، وعملاً متقبلاً");
            add("اللهم إني أعوذ بك من يوم السوء، ومن ليلة السوء، ومن ساعة السوء، ومن صاحب السوء، ");
            add("اللهم إني أعوذ بك من قلب لا يخشع، ومن دعاء لا يسمع");
            add("اللهم إني أعوذ بك من جار السوء في دار المقامة؛ فإن جار البادية يتحول");
            add("اللهم إني أعوذ بك من الفقر، والقلة، والذلة، وأعوذ بك من أن أظلم أو أظلم");
            add("اللهم إني أسألك من فضلك ورحمتك، فإنه لا يملكها إلا أنت");
            add("اللهم اغفر لي ذنبي، ووسع لي في داري، وبارك لي في رزقي");
            add("اللهم إني أسألك الجنة وأستجير بك من النار");
            add("رب اغفر لي، وتب علي، إنك أنت التواب الغفور");
            add("اللهم إني أسألك علماً نافعاً، ورزقاً طيباً، وعملاً متقبلاً");
            add("اللهم انفعني بما علمتني، وعلمني ما ينفعني، وزدني علماً");
            add("اللهم إني أعوذ بك أن أشرك بك وأنا أعلم، وأستغفرك لما لا أعلم");
            add("اللهم فقهني في الدين");
            add("اللهم جنبني منكرات الأخلاق، والأهواء، والأعمال، والأدواء");
            add("اللهم إني أسألك علماً نافعاً، وأعوذ بك من علم لا ينفع");
            add("اللهم ألهمني رشدي، وأعذني من شر نفسي");
            add("اللهم إني أعوذ بك من البخل، والجبن، وسوء العمر، وفتنة الصدر، وعذاب القبر");
            add("اللهم طهرني من الذنوب والخطايا");
            add("اللهم ارزقني حبك، وحب من ينفعني حبه عندك");
            add("اللهم إني أعوذ بك من غلبة الدين، وغلبة العدو، وشماتة الأعداء");
            add("اللهم اغفر لي ما أسررت، وما أعلنت، وما أخطأت، وما عمدت، وما علمت، وما جهلت");
            add("اللهم قني شر نفسي، واعزم لي على أرشد أمري");
            add("اللهم إني أسألك إيماناً لا يرتد، ونعيماً لا ينفذ");
            add("اللهم أعنا على ذكرك، وشكرك، وحسن عبادتك");
            add("اللهم قنعني بما رزقتني، وبارك لي فيه، واخلف عليّ كل غائبة لي بخير");
            add("اللهم ثبتني واجعلني هادياً مهدياً");
            add("اللهم أحسنت خَلقي فأحسن خُلُقي");
            add("اللهم زدنا ولا تنقصنا، وأكرمنا ولا تهنا، وأعطنا ولا تحرمنا");
            add("اللهم إني أسألك عيشة نقية، وميتة سوية، ومرداً غير مخز ولا فاضح");
            add("اللهم متعني بسمعي، وبصري، واجعلهما الوارث مني");
            add("اللهم اغفر لي، واهدني، وارزقني، وعافني، أعوذ بالله من ضيق المقام يوم القيامة");
            add("اللهم قنى عذابك يوم تبعث عبادك");
            add("اللهم انى اسئلك حبك وحب من يحبك والعمل الذى يبلغنى حبك");
            add("اللهم اكفنى بحلالك عن حرامك وأعننى بفضلك عمن سواك");
            add("اللهم اغفر لى جدى وهزلى وخطئ وعمدى وكل ذلك عندى");
            add(" اللهم اغفر لى خطيئتى وجهلى، واسرافى فى امرى وما انت اعلم به منى");
            add("اللهم آتني الحكمة التي من أوتيها فقد أوتي خيراً كثير");
            add("أعوذ بالله العظيم من الشيطان الرجيم");
            add("بِسْمِ اللّهِ الرَّحْمنِ الرَّحِيمِ ");
            add("اللهم أنت ربى لا إله إلا أنت خلقتنى وانا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء لك بنعمتك على وأبوء بذنبى فاغفر لى فإنه لا يغفر الذنوب إلا أنت");
            add("اللهم انى اعوذ بك من شر ماعملت ومن شر مالم اعمل");
            add("يا حى ياقيوم برحمتك استغيث");
            add("ﺭﺑﻨﺎ ﺗﻘﺒﻞ ﻣﻨﺎ ﺇﻧﻚ ﺃﻧﺖ ﺍﻟﺴﻤﻴﻊ ﺍﻟﻌﻠﻴﻢ، ﻭﺗﺐ ﻋﻠﻴﻨﺎ ﺇﻧﻚ ﺃﻧﺖ ﺍﻟﺘﻮﺍﺏ ﺍﻟﺮﺣﻴﻢ");
            add("ﺭﺑﻨﺎ ﺁﺗﻨﺎ ﻓﻲ ﺍﻟﺪﻧﻴﺎ ﺣﺴﻨﺔ ﻭﻓﻲ ﺍﻵﺧﺮﺓ ﺣﺴﻨﺔ ﻭﻗﻨﺎ ﻋﺬﺍﺏ ﺍﻟﻨﺎﺭ");
            add("ﺭﺑﻨﺎ ﺃﻓﺮﻍ ﻋﻠﻴﻨﺎ ﺻﺒﺮﺍ ﻭﺛﺒﺖ ﺃﻗﺪﺍﻣﻨﺎ ﻭﺍﻧﺼﺮﻧﺎ ﻋﻠﻰ ﺍﻟﻘﻮﻡ ﺍﻟﻜﺎﻓﺮﻳﻦ");
            add("ﺭﺑﻨﺎ ﻻ ﺗﺆﺍﺧﺬﻧﺎ ﺇﻥ ﻧﺴﻴﻨﺎ ﺃﻭ ﺃﺧﻄﺎﻧﺎ، ﺭﺑﻨﺎ ﻭﻻ ﺗﺤﻤﻞ ﻋﻠﻴﻨﺎ ﺇﺻﺮﺍ ﻛﻤﺎ ﺣﻤﻠﺘﻪ ﻋﻠﻰ ﺍﻟﺬﻳﻦ ﻣﻦ ﻗﺒﻠﻨﺎ");
            add("ﺭﺑﻨﺎ ﻭﻻ ﺗﺤﻤﻠﻨﺎ ﻣﺎ ﻻ ﻃﺎﻗﺔ ﻟﻨﺎ ﺑﻪ ﻭﺍﻋﻒ ﻋﻨﺎ ﻭﺍﻏﻔﺮ ﻟﻨﺎ ﻭﺍﺭﺣﻤﻨﺎ ﺃﻧﺖ ﻣﻮﻻﻧﺎ ﻓﺎﻧﺼﺮﻧﺎ ﻋﻠﻰ ﺍﻟﻘﻮﻡ ﺍﻟﻜﺎﻓﺮﻳﻦ");
            add("ﺭﺑﻨﺎ ﻻ ﺗﺰﻍ ﻗﻠﻮﺑﻨﺎ ﺑﻌﺪ ﺇﺫ ﻫﺪﻳﺘﻨﺎ ﻭﻫﺐ ﻟﻨﺎ ﻣﻦ ﻟﺪﻧﻚ ﺭﺣﻤﺔ ﺇﻧﻚ ﺃﻧﺖ ﺍﻟﻮﻫﺎﺏ");
            add("ﺭﺑﻨﺎ ﺇﻧﻨﺎ ﺁﻣﻨﺎ ﻓﺎﻏﻔﺮ ﻟﻨﺎ ﺫﻧﻮﺑﻨﺎ ﻭﻗﻨﺎ ﻋﺬﺍﺏ ﺍﻟﻨﺎﺭ");
            add("ﺭﺏ ﻫﺐ ﻟﻲ ﻣﻦ ﻟﺪﻧﻚ ﺫﺭﻳﺔ ﻃﻴﺒﺔ ﺇﻧﻚ ﺳﻤﻴﻊ ﺍﻟﺪﻋﺎﺀ");
            add("ﺭﺑﻨﺎ ﺁﻣﻨﺎ ﺑﻤﺎ ﺃﻧﺰﻟﺖ ﻭﺍﺗﺒﻌﻨﺎ ﺍﻟﺮﺳﻮﻝ ﻓﺎﻛﺘﺒﻨﺎ ﻣﻊ ﺍﻟﺸﺎﻫﺪﻳﻦ");
            add("ﺭﺑﻨﺎ ﺍﻏﻔﺮ ﻟﻨﺎ ﺫﻧﻮﺑﻨﺎ ﻭﺇﺳﺮﺍﻓﻨﺎ ﻓﻲ ﺃﻣﺮﻧﺎ ﻭﺛﺒﺖ ﺃﻗﺪﺍﻣﻨﺎ ﻭﺍﻧﺼﺮﻧﺎ ﻋﻠﻰ ﺍﻟﻘﻮﻡ ﺍﻟﻜﺎﻓﺮﻳﻦ");
            add("ﺭﺑﻨﺎ ﻣﺎ ﺧﻠﻘﺖ ﻫﺬﺍ ﺑﺎﻃﻼ ﺳﺒﺤﺎﻧﻚ ﻓﻘﻨﺎ ﻋﺬﺍﺏ ﺍﻟﻨﺎﺭ");
            add("ﺭﺑﻨﺎ ﺇﻧﻨﺎ ﺳﻤﻌﻨﺎ ﻣﻨﺎﺩﻳﺎ ﻳﻨﺎﺩﻱ ﻟﻺﻳﻤﺎﻥ ﺃﻥ ﺍﻣﻨﻮﺍ ﺑﺮﺑﻜﻢ ﻓﺂﻣﻨﺎ، ﺭﺑﻨﺎ ﻓﺎﻏﻔﺮ ﻟﻨﺎ ﺫﻧﻮﺑﻨﺎ ﻭﻛﻔﺮ ﻋﻨﺎ ﺳﻴﺌﺎﺗﻨﺎ ﻭﺗﻮﻓﻨﺎ ﻣﻊ ﺍﻷﺑﺮﺍﺭ");
            add("ﺭﺑﻨﺎ ﻭﺍﺗﻨﺎ ﻣﺎ ﻭﻋﺪﺗﻨﺎ ﻋﻠﻰ ﺭﺳﻠﻚ ﻭﻻ ﺗﺨﺰﻧﺎ ﻳﻮﻡ ﺍﻟﻘﻴﺎﻣﺔ ﺇﻧﻚ ﻻ ﺗﺨﻠﻒ ﺍﻟﻤﻴﻌﺎﺩ");
            add("ﺭﺑﻨﺎ ﻇﻠﻤﻨﺎ ﺃﻧﻔﺴﻨﺎ ﻭﺍﻥ ﻟﻢ ﺗﻐﻔﺮ ﻟﻨﺎ ﻭﺗﺮﺣﻤﻨﺎ ﻟﻨﻜﻮﻧﻦ ﻣﻦ ﺍﻟﺨﺎﺳﺮﻳﻦ");
            add("ﺭﺑﻨﺎ ﺍﻓﺘﺢ ﺑﻴﻨﻨﺎ ﻭﺑﻴﻦ ﻗﻮﻣﻨﺎ ﺑﺎﻟﺤﻖ ﻭﺃﻧﺖ ﺧﻴﺮ ﺍﻟﻔﺎﺗﺤﻴﻦ");
            add(" ﺭﺑﻨﺎ ﺍﻓﺮﻍ ﻋﻠﻴﻨﺎ ﺻﺒﺮﺍ ﻭﺗﻮﻓﻨﺎ ﻣﺴﻠﻤﻴﻦ، ﺃﻧﺖ ﻭﻟﻴﻨﺎ ﻓﺎﻏﻔﺮ ﻟﻨﺎ ﻭﺍﺭﺣﻤﻨﺎ ﻭﺃﻧﺖ ﺧﻴﺮ ﺍﻟﻐﺎﻓﺮﻳﻦ");
            add("ﺭﺑﻨﺎ ﻻ ﺗﺠﻌﻠﻨﺎ ﻓﺘﻨﺔ ﻟﻠﻘﻮﻡ ﺍﻟﻈﺎﻟﻤﻴﻦ ﻭﻧﺠﻨﺎ ﺑﺮﺣﻤﺘﻚ ﻣﻦ ﺍﻟﻘﻮﻡ ﺍﻟﻜﺎﻓﺮﻳﻦ");
            add("ﺭﺏ ﺇﻧﻲ ﺃﻋﻮﺫ ﺑﻚ ﺃﻥ ﺃﺳﺎﻟﻚ ﻣﺎ ﻟﻴﺲ ﻟﻲ ﺑﻪ ﻋﻠﻢ ﻭﺇﻻ ﺗﻐﻔﺮ ﻟﻲ ﻭﺗﺮﺣﻤﻨﻲ ﺃﻛﻦ ﻣﻦ ﺍﻟﺨﺎﺳﺮﻳﻦ");
            add("ﺭﺏ ﺃﻧﺖ ﻭﻟﻴﻲ ﻓﻲ ﺍﻟﺪﻧﻴﺎ ﻭﺍﻵﺧﺮﺓ ﺗﻮﻓﻨﻲ ﻣﺴﻠﻤﺎ ﻭﺃﻟﺤﻘﻨﻲ ﺑﺎﻟﺼﺎﻟﺤﻴﻦ");
            add("ﺭﺑﻨﺎ ﺁﺗﻨﺎ ﻣﻦ ﻟﺪﻧﻚ ﺭﺣﻤﺔ ﻭﻫﻴﺊ ﻟﻨﺎ ﻣﻦ ﺃﻣﺮﻧﺎ ﺭﺷﺪﺍ");

            add("ﺭﺏ ﺃﻋﻮﺫ ﺑﻚ ﻣﻦ ﻫﻤﺰﺍﺕ ﺍﻟﺸﻴﺎﻃﻴﻦ ﻭﺃﻋﻮﺫ ﺑﻚ ﺭﺏ ﺃﻥ ﻳﺤﻀﺮﻭﻥ");
            add("ﺭﺑﻨﺎ ﺍﺻﺮﻑ ﻋﻨﺎ ﻋﺬﺍﺏ ﺟﻬﻨﻢ ﺇﻥ ﻋﺬﺍﺑﻬﺎ ﻛﺎﻥ ﻏﺮﺍﻣﺎ ﺇﻧﻬﺎ ﺳﺎﺀﺕ ﻣﺴﺘﻘﺮﺍ ﻭﻣﻘﺎﻣﺎ");
            add("ﺭﺑﻨﺎ ﻫﺐ ﻟﻨﺎ ﻣﻦ ﺃﺯﻭﺍﺟﻨﺎ ﻭﺫﺭﻳﺎﺗﻨﺎ ﻗﺮﺓ ﺃﻋﻴﻦ ﻭﺍﺟﻌﻠﻨﺎ ﻟﻠﻤﺘﻘﻴﻦ ﺇﻣﺎﻣﺎ");
            add("ﺭﺏ ﻧﺠﻨﻲ ﻭﺃﻫﻠﻲ ﻣﻤﺎ ﻳﻌﻤﻠﻮﻥ");
            add("ﺭﺑﻨﺎ ﻭﺳﻌﺖ ﻛﻞ ﺷﻲﺀ ﺭﺣﻤﺔ ﻭﻋﻠﻤﺎ ﻓﺎﻏﻔﺮ ﻟﻠﺬﻳﻦ ﺗﺎﺑﻮﺍ ﻭﺍﺗﺒﻌﻮﺍ ﺳﺒﻴﻠﻚ ﻭﻗﻬﻢ ﻋﺬﺍﺏ ﺍﻟﺠﺤﻴم");
            add("اللهم أحيني على سنة نبيك وتوفني على ملته، وأعذني من مضلات الفتن");
            add("اللهم إني أسألك شهادة في سبيلك");
            add("اللهم إني أسألك المعافاة في الدنيا والآخرة");
            add("اللهم لا تخزني يوم القيامة");
            add("اللهم إني أعوذ بك من علم لا ينفع، وعمل لا يرفع، وقلب لا يخشع، وقول لا يسمع");

            add("اللهم جدد الإيمان في قلبي");
            add("اللهم إني أعوذ بك من غلبة الدين، وغلبة العدو، وشماتة الأعداء");
            add("اللهم أعنا على ذكرك، وشكرك، وحسن عبادتك");
            add("اللهم إني أسألك عيشة نقية، وميتة سوية، ومردا غير مخز ولا فاضح");
            add("اللهم جنبني منكرات الأخلاق، والأهواء، والأعمال، والأدواء");
            add("اللهم ألهمني رشدي، وأعذني من شر نفسي");
            add("اللهم إني أسألك علما نافعا، ورزقا طيبا، وعملا متقبلا");
            add("اللهم إني أعوذ بك أن أشرك بك وأنا أعلم، وأستغفرك لما لا أعلم");
            add("اللهم إني أعوذ بك من منكرات الأخلاق، والأعمال، والأهواء");

            add("اللهم مصرف القلوب صرف قلوبنا على طاعتك");
            add("اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين، وأصلح لي شأني كله لا إله إلا أنت");
            add("اللهم إني أعوذ بك من زوال نعمتك، وتحول عافيتك، وفجاءة نقمتك، وجميع سخطك");
            add("اللهم إني أعوذ بك من شر ما عملت، ومن شر ما لم أعمل");
            add("اللهم أكثر مالي، وولدي، وبارك لي فيما أعطيتني");
            add("اللهم قني شح نفسي واجعلني من المفلحين");
            add("اللهم إفتح لي ابواب الخير والرزق والسعادة من حيث لا أحتسب");

        }
    }; // الاذكار المراد اضافتها في التطبيق
    // endregion
    private static boolean isShowingWindow = false;
    private WindowManager wm;
    private LayoutInflater inflater;
    private View ly;

    // region Variables
    public static String getRandomMessage() {
        int nextInt = new Random().nextInt(azkar.size() - 1);
        return azkar.get(nextInt);
    }

    /*
     * public void onReceive(Context context, Intent intent) {
     * Log.d("Notification_Log", "onReceive: ");
     * int nextInt = new Random().nextInt(azkar.size() - 1);
     * ActivityUtils.showCustomToast(context, azkar.get(nextInt));
     * UtilNotif.showNotification(context, azkar.get(nextInt));
     * }
     */
    @Override
    public void onReceive(Context context, Intent intent) {

        String azkarMessage = ReciverNoti.getRandomMessage();
        show(context, azkarMessage);

    }

    private void show(Context context, String message) {
        showWindow(context, message);
        UtilNotif.showNotification(context, message);
    }

    private void showWindow(Context ctx, String text) {
        if (wm == null)
            wm = (WindowManager) ctx.getSystemService(Context.WINDOW_SERVICE);
        if (inflater == null)
            inflater = LayoutInflater.from(ctx);

        int type = WindowManager.LayoutParams.TYPE_SYSTEM_ALERT |
                WindowManager.LayoutParams.TYPE_SYSTEM_OVERLAY;

        if (Build.VERSION.SDK_INT >= Build.VERSION_CODES.O) {
            type = WindowManager.LayoutParams.TYPE_APPLICATION_OVERLAY;
        }

        WindowManager.LayoutParams params = new WindowManager.LayoutParams(
                WindowManager.LayoutParams.MATCH_PARENT,
                WindowManager.LayoutParams.WRAP_CONTENT,
                type,
                WindowManager.LayoutParams.FLAG_NOT_TOUCH_MODAL |
                        WindowManager.LayoutParams.FLAG_NOT_FOCUSABLE,
                PixelFormat.TRANSPARENT);

        params.width = WindowManager.LayoutParams.MATCH_PARENT;
        params.height = WindowManager.LayoutParams.WRAP_CONTENT;
        params.format = PixelFormat.TRANSLUCENT;

        params.gravity = Gravity.TOP | Gravity.END;

        ly = inflater.inflate(R.layout.content_toast, null, false);
        ((TextView) ly.findViewById(R.id.tv_message)).setText(text);
        ly.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                if (wm != null) {
                    wm.removeView(ly);
                    isShowingWindow = false;
                }
            }
        });

        wm.addView(ly, params);
    }
    // endregion

}
